GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F56Q83.inc
;----- C1RXIF Bits -----------------------------------------------------
RFIF0            EQU  H'0001'
RFIF1            EQU  H'0002'
RFIF2            EQU  H'0003'
RFIF3            EQU  H'0004'
RFIF4            EQU  H'0005'
RFIF5            EQU  H'0006'
RFIF6            EQU  H'0007'
RFIF1            EQU  H'0001'
RFIF2            EQU  H'0002'
RFIF3            EQU  H'0003'
RFIF4            EQU  H'0004'
RFIF5            EQU  H'0005'
RFIF6            EQU  H'0006'
RFIF7            EQU  H'0007'


;----- C1RXIFH Bits -----------------------------------------------------
RFIF8            EQU  H'0000'
RFIF9            EQU  H'0001'
RFIF10           EQU  H'0002'
RFIF11           EQU  H'0003'
RFIF12           EQU  H'0004'
RFIF13           EQU  H'0005'
RFIF14           EQU  H'0006'
RFIF15           EQU  H'0007'


;----- C1RXIFU Bits -----------------------------------------------------
RFIF16           EQU  H'0000'
RFIF17           EQU  H'0001'
RFIF18           EQU  H'0002'
RFIF19           EQU  H'0003'
RFIF20           EQU  H'0004'
RFIF21           EQU  H'0005'
RFIF22           EQU  H'0006'
RFIF23           EQU  H'0007'


;----- C1RXIFT Bits -----------------------------------------------------
RFIF24           EQU  H'0000'
RFIF25           EQU  H'0001'
RFIF26           EQU  H'0002'
RFIF27           EQU  H'0003'
RFIF28           EQU  H'0004'
RFIF29           EQU  H'0005'
RFIF30           EQU  H'0006'
RFIF31           EQU  H'0007'


;----- C1TXIF Bits -----------------------------------------------------
TFIF0            EQU  H'0000'
TFIF1            EQU  H'0001'
TFIF2            EQU  H'0002'
TFIF3            EQU  H'0003'
TFIF4            EQU  H'0004'
TFIF5            EQU  H'0005'
TFIF6            EQU  H'0006'
TFIF7            EQU  H'0007'


;----- C1TXIFH Bits -----------------------------------------------------
TFIF8            EQU  H'0000'
TFIF9            EQU  H'0001'
TFIF10           EQU  H'0002'
TFIF11           EQU  H'0003'
TFIF12           EQU  H'0004'
TFIF13           EQU  H'0005'
TFIF14           EQU  H'0006'
TFIF15           EQU  H'0007'


;----- C1TXIFU Bits -----------------------------------------------------
TFIF16           EQU  H'0000'
TFIF17           EQU  H'0001'
TFIF18           EQU  H'0002'
TFIF19           EQU  H'0003'
TFIF20           EQU  H'0004'
TFIF21           EQU  H'0005'
TFIF22           EQU  H'0006'
TFIF23           EQU  H'0007'


;----- C1TXIFT Bits -----------------------------------------------------
TFIF24           EQU  H'0000'
TFIF25           EQU  H'0001'
TFIF26           EQU  H'0002'
TFIF27           EQU  H'0003'
TFIF28           EQU  H'0004'
TFIF29           EQU  H'0005'
TFIF30           EQU  H'0006'
TFIF31           EQU  H'0007'


;----- C1RXOVIF Bits -----------------------------------------------------
RFOVIF0          EQU  H'0001'
RFOVIF1          EQU  H'0002'
RFOVIF2          EQU  H'0003'
RFOVIF3          EQU  H'0004'
RFOVIF4          EQU  H'0005'
RFOVIF5          EQU  H'0006'
RFOVIF6          EQU  H'0007'
RFOVIF1          EQU  H'0001'
RFOVIF2          EQU  H'0002'
RFOVIF3          EQU  H'0003'
RFOVIF4          EQU  H'0004'
RFOVIF5          EQU  H'0005'
RFOVIF6          EQU  H'0006'
RFOVIF7          EQU  H'0007'


;----- C1RXOVIFH Bits -----------------------------------------------------
RFOVIF8          EQU  H'0000'
RFOVIF9          EQU  H'0001'
RFOVIF10         EQU  H'0002'
RFOVIF11         EQU  H'0003'
RFOVIF12         EQU  H'0004'
RFOVIF13         EQU  H'0005'
RFOVIF14         EQU  H'0006'
RFOVIF15         EQU  H'0007'


;----- C1RXOVIFU Bits -----------------------------------------------------
RFOVIF16         EQU  H'0000'
RFOVIF17         EQU  H'0001'
RFOVIF18         EQU  H'0002'
RFOVIF19         EQU  H'0003'
RFOVIF20         EQU  H'0004'
RFOVIF21         EQU  H'0005'
RFOVIF22         EQU  H'0006'
RFOVIF23         EQU  H'0007'


;----- C1RXOVIFT Bits -----------------------------------------------------
RFOVIF24         EQU  H'0000'
RFOVIF25         EQU  H'0001'
RFOVIF26         EQU  H'0002'
RFOVIF27         EQU  H'0003'
RFOVIF28         EQU  H'0004'
RFOVIF29         EQU  H'0005'
RFOVIF30         EQU  H'0006'
RFOVIF31         EQU  H'0007'


;----- C1TXATIF Bits -----------------------------------------------------
TFATIF0          EQU  H'0000'
TFATIF1          EQU  H'0001'
TFATIF2          EQU  H'0002'
TFATIF3          EQU  H'0003'
TFATIF4          EQU  H'0004'
TFATIF5          EQU  H'0005'
TFATIF6          EQU  H'0006'
TFATIF7          EQU  H'0007'


;----- C1TXATIFH Bits -----------------------------------------------------
TFATIF8          EQU  H'0000'
TFATIF9          EQU  H'0001'
TFATIF10         EQU  H'0002'
TFATIF11         EQU  H'0003'
TFATIF12         EQU  H'0004'
TFATIF13         EQU  H'0005'
TFATIF14         EQU  H'0006'
TFATIF15         EQU  H'0007'


;----- C1TXATIFU Bits -----------------------------------------------------
TFATIF16         EQU  H'0000'
TFATIF17         EQU  H'0001'
TFATIF18         EQU  H'0002'
TFATIF19         EQU  H'0003'
TFATIF20         EQU  H'0004'
TFATIF21         EQU  H'0005'
TFATIF22         EQU  H'0006'
TFATIF23         EQU  H'0007'


;----- C1TXATIFT Bits -----------------------------------------------------
TFATIF24         EQU  H'0000'
TFATIF25         EQU  H'0001'
TFATIF26         EQU  H'0002'
TFATIF27         EQU  H'0003'
TFATIF28         EQU  H'0004'
TFATIF29         EQU  H'0005'
TFATIF30         EQU  H'0006'
TFATIF31         EQU  H'0007'


;----- C1TXREQ Bits -----------------------------------------------------
TXREQ0           EQU  H'0000'
TXREQ1           EQU  H'0001'
TXREQ2           EQU  H'0002'
TXREQ3           EQU  H'0003'
TXREQ4           EQU  H'0004'
TXREQ5           EQU  H'0005'
TXREQ6           EQU  H'0006'
TXREQ7           EQU  H'0007'


;----- C1TXREQH Bits -----------------------------------------------------
TXREQ8           EQU  H'0000'
TXREQ9           EQU  H'0001'
TXREQ10          EQU  H'0002'
TXREQ11          EQU  H'0003'
TXREQ12          EQU  H'0004'
TXREQ13          EQU  H'0005'
TXREQ14          EQU  H'0006'
TXREQ15          EQU  H'0007'


;----- C1TXREQU Bits -----------------------------------------------------
TXREQ16          EQU  H'0000'
TXREQ17          EQU  H'0001'
TXREQ18          EQU  H'0002'
TXREQ19          EQU  H'0003'
TXREQ20          EQU  H'0004'
TXREQ21          EQU  H'0005'
TXREQ22          EQU  H'0006'
TXREQ23          EQU  H'0007'


;----- C1TXREQT Bits -----------------------------------------------------
TXREQ24          EQU  H'0000'
TXREQ25          EQU  H'0001'
TXREQ26          EQU  H'0002'
TXREQ27          EQU  H'0003'
TXREQ28          EQU  H'0004'
TXREQ29          EQU  H'0005'
TXREQ30          EQU  H'0006'
TXREQ31          EQU  H'0007'


;----- C1TRECL Bits -----------------------------------------------------
RERRCNT0         EQU  H'0000'
RERRCNT1         EQU  H'0001'
RERRCNT2         EQU  H'0002'
RERRCNT3         EQU  H'0003'
RERRCNT4         EQU  H'0004'
RERRCNT5         EQU  H'0005'
RERRCNT6         EQU  H'0006'
RERRCNT7         EQU  H'0007'


;----- C1TRECH Bits -----------------------------------------------------
TERRCNT0         EQU  H'0000'
TERRCNT1         EQU  H'0001'
TERRCNT2         EQU  H'0002'
TERRCNT3         EQU  H'0003'
TERRCNT4         EQU  H'0004'
TERRCNT5         EQU  H'0005'
TERRCNT6         EQU  H'0006'
TERRCNT7         EQU  H'0007'


