GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F56Q83.inc
;----- C1FIFOCON1U Bits -----------------------------------------------------
TXPRI0           EQU  H'0000'
TXPRI1           EQU  H'0001'
TXPRI2           EQU  H'0002'
TXPRI3           EQU  H'0003'
TXPRI4           EQU  H'0004'
TXAT0            EQU  H'0005'
TXAT1            EQU  H'0006'
TXPRI0           EQU  H'0000'
TXPRI1           EQU  H'0001'
TXPRI2           EQU  H'0002'
TXPRI3           EQU  H'0003'
TXPRI4           EQU  H'0004'
TXAT0            EQU  H'0005'
TXAT1            EQU  H'0006'


;----- C1FIFOCON1T Bits -----------------------------------------------------
FSIZE0           EQU  H'0000'
FSIZE1           EQU  H'0001'
FSIZE2           EQU  H'0002'
FSIZE3           EQU  H'0003'
FSIZE4           EQU  H'0004'
FSIZE0           EQU  H'0000'
FSIZE1           EQU  H'0001'
FSIZE2           EQU  H'0002'
FSIZE3           EQU  H'0003'
FSIZE4           EQU  H'0004'


;----- C1FIFOSTA1 Bits -----------------------------------------------------
TFNRFNIF         EQU  H'0000'
TFHRFHIF         EQU  H'0001'
TFERFFIF         EQU  H'0002'
RXOVIF           EQU  H'0003'
TXATIF           EQU  H'0004'
TXERR            EQU  H'0005'
TXLARB           EQU  H'0006'
TXABT            EQU  H'0007'


;----- C1FIFOSTA1H Bits -----------------------------------------------------
FIFOCI0          EQU  H'0000'
FIFOCI1          EQU  H'0001'
FIFOCI2          EQU  H'0002'
FIFOCI3          EQU  H'0003'
FIFOCI4          EQU  H'0004'
FIFOCI0          EQU  H'0000'
FIFOCI1          EQU  H'0001'
FIFOCI2          EQU  H'0002'
FIFOCI3          EQU  H'0003'
FIFOCI4          EQU  H'0004'


;----- C1FIFOUA1 Bits -----------------------------------------------------
FIFOUA0          EQU  H'0000'
FIFOUA1          EQU  H'0001'
FIFOUA2          EQU  H'0002'
FIFOUA3          EQU  H'0003'
FIFOUA4          EQU  H'0004'
FIFOUA5          EQU  H'0005'
FIFOUA6          EQU  H'0006'
FIFOUA7          EQU  H'0007'


;----- C1FIFOUA1H Bits -----------------------------------------------------
FIFOUA8          EQU  H'0000'
FIFOUA9          EQU  H'0001'
FIFOUA10         EQU  H'0002'
FIFOUA11         EQU  H'0003'
FIFOUA12         EQU  H'0004'
FIFOUA13         EQU  H'0005'
FIFOUA14         EQU  H'0006'
FIFOUA15         EQU  H'0007'


;----- C1FIFOUA1U Bits -----------------------------------------------------
FIFOUA16         EQU  H'0000'
FIFOUA17         EQU  H'0001'
FIFOUA18         EQU  H'0002'
FIFOUA19         EQU  H'0003'
FIFOUA20         EQU  H'0004'
FIFOUA21         EQU  H'0005'
FIFOUA22         EQU  H'0006'
FIFOUA23         EQU  H'0007'


;----- C1FIFOUA1T Bits -----------------------------------------------------
FIFOUA24         EQU  H'0000'
FIFOUA25         EQU  H'0001'
FIFOUA26         EQU  H'0002'
FIFOUA27         EQU  H'0003'
FIFOUA28         EQU  H'0004'
FIFOUA29         EQU  H'0005'
FIFOUA30         EQU  H'0006'
FIFOUA31         EQU  H'0007'


;----- C1FIFOCON2 Bits -----------------------------------------------------
TFNRFNIE         EQU  H'0000'
TFHRFHIE         EQU  H'0001'
TFERFFIE         EQU  H'0002'
RXOVIE           EQU  H'0003'
TXATIE           EQU  H'0004'
RXTSEN           EQU  H'0005'
RTREN            EQU  H'0006'
TXEN             EQU  H'0007'


;----- C1FIFOCON2H Bits -----------------------------------------------------
UINC             EQU  H'0000'
TXREQ            EQU  H'0001'
FRESET           EQU  H'0002'


;----- C1FIFOCON2U Bits -----------------------------------------------------
TXPRI0           EQU  H'0000'
TXPRI1           EQU  H'0001'
TXPRI2           EQU  H'0002'
TXPRI3           EQU  H'0003'
TXPRI4           EQU  H'0004'
TXAT0            EQU  H'0005'
TXAT1            EQU  H'0006'
TXPRI0           EQU  H'0000'
TXPRI1           EQU  H'0001'
TXPRI2           EQU  H'0002'
TXPRI3           EQU  H'0003'
TXPRI4           EQU  H'0004'
TXAT0            EQU  H'0005'
TXAT1            EQU  H'0006'


;----- C1FIFOCON2T Bits -----------------------------------------------------
FSIZE0           EQU  H'0000'
FSIZE1           EQU  H'0001'
FSIZE2           EQU  H'0002'
FSIZE3           EQU  H'0003'
FSIZE4           EQU  H'0004'
FSIZE0           EQU  H'0000'
FSIZE1           EQU  H'0001'
FSIZE2           EQU  H'0002'
FSIZE3           EQU  H'0003'
FSIZE4           EQU  H'0004'


;----- C1FIFOSTA2 Bits -----------------------------------------------------
TFNRFNIF         EQU  H'0000'
TFHRFHIF         EQU  H'0001'
TFERFFIF         EQU  H'0002'
RXOVIF           EQU  H'0003'
TXATIF           EQU  H'0004'
TXERR            EQU  H'0005'
TXLARB           EQU  H'0006'
TXABT            EQU  H'0007'


;----- C1FIFOSTA2H Bits -----------------------------------------------------
FIFOCI0          EQU  H'0000'
FIFOCI1          EQU  H'0001'
FIFOCI2          EQU  H'0002'
FIFOCI3          EQU  H'0003'
FIFOCI4          EQU  H'0004'
FIFOCI0          EQU  H'0000'
FIFOCI1          EQU  H'0001'
FIFOCI2          EQU  H'0002'
FIFOCI3          EQU  H'0003'
FIFOCI4          EQU  H'0004'


;----- C1FIFOUA2 Bits -----------------------------------------------------
FIFOUA0          EQU  H'0000'
FIFOUA1          EQU  H'0001'
FIFOUA2          EQU  H'0002'
FIFOUA3          EQU  H'0003'
FIFOUA4          EQU  H'0004'
FIFOUA5          EQU  H'0005'
FIFOUA6          EQU  H'0006'
FIFOUA7          EQU  H'0007'


;----- C1FIFOUA2H Bits -----------------------------------------------------
FIFOUA8          EQU  H'0000'
FIFOUA9          EQU  H'0001'
FIFOUA10         EQU  H'0002'
FIFOUA11         EQU  H'0003'
FIFOUA12         EQU  H'0004'
FIFOUA13         EQU  H'0005'
FIFOUA14         EQU  H'0006'
FIFOUA15         EQU  H'0007'


;----- C1FIFOUA2U Bits -----------------------------------------------------
FIFOUA16         EQU  H'0000'
FIFOUA17         EQU  H'0001'
FIFOUA18         EQU  H'0002'
FIFOUA19         EQU  H'0003'
FIFOUA20         EQU  H'0004'
FIFOUA21         EQU  H'0005'
FIFOUA22         EQU  H'0006'
FIFOUA23         EQU  H'0007'


;----- C1FIFOUA2T Bits -----------------------------------------------------
FIFOUA24         EQU  H'0000'
FIFOUA25         EQU  H'0001'
FIFOUA26         EQU  H'0002'
FIFOUA27         EQU  H'0003'
FIFOUA28         EQU  H'0004'
FIFOUA29         EQU  H'0005'
FIFOUA30         EQU  H'0006'
FIFOUA31         EQU  H'0007'


;----- C1FIFOCON3 Bits -----------------------------------------------------
TFNRFNIE         EQU  H'0000'
TFHRFHIE         EQU  H'0001'
TFERFFIE         EQU  H'0002'
RXOVIE           EQU  H'0003'
TXATIE           EQU  H'0004'
RXTSEN           EQU  H'0005'
RTREN            EQU  H'0006'
TXEN             EQU  H'0007'


;----- C1FIFOCON3H Bits -----------------------------------------------------
UINC             EQU  H'0000'
TXREQ            EQU  H'0001'
FRESET           EQU  H'0002'


;----- C1FIFOCON3U Bits -----------------------------------------------------
TXPRI0           EQU  H'0000'
TXPRI1           EQU  H'0001'
TXPRI2           EQU  H'0002'
TXPRI3           EQU  H'0003'
TXPRI4           EQU  H'0004'
TXAT0            EQU  H'0005'
TXAT1            EQU  H'0006'
TXPRI0           EQU  H'0000'
TXPRI1           EQU  H'0001'
TXPRI2           EQU  H'0002'
TXPRI3           EQU  H'0003'
TXPRI4           EQU  H'0004'
TXAT0            EQU  H'0005'
TXAT1            EQU  H'0006'


;----- C1FIFOCON3T Bits -----------------------------------------------------
FSIZE0           EQU  H'0000'
FSIZE1           EQU  H'0001'
FSIZE2           EQU  H'0002'
FSIZE3           EQU  H'0003'
FSIZE4           EQU  H'0004'
FSIZE0           EQU  H'0000'
FSIZE1           EQU  H'0001'
FSIZE2           EQU  H'0002'
FSIZE3           EQU  H'0003'
FSIZE4           EQU  H'0004'


;----- C1FIFOSTA3 Bits -----------------------------------------------------
TFNRFNIF         EQU  H'0000'
TFHRFHIF         EQU  H'0001'
TFERFFIF         EQU  H'0002'
RXOVIF           EQU  H'0003'
TXATIF           EQU  H'0004'
TXERR            EQU  H'0005'
TXLARB           EQU  H'0006'
TXABT            EQU  H'0007'


;----- C1FIFOSTA3H Bits -----------------------------------------------------
FIFOCI0          EQU  H'0000'
FIFOCI1          EQU  H'0001'
FIFOCI2          EQU  H'0002'
FIFOCI3          EQU  H'0003'
FIFOCI4          EQU  H'0004'
FIFOCI0          EQU  H'0000'
FIFOCI1          EQU  H'0001'
FIFOCI2          EQU  H'0002'
FIFOCI3          EQU  H'0003'
FIFOCI4          EQU  H'0004'


;----- C1FIFOUA3 Bits -----------------------------------------------------
FIFOUA0          EQU  H'0000'
FIFOUA1          EQU  H'0001'
FIFOUA2          EQU  H'0002'
FIFOUA3          EQU  H'0003'
FIFOUA4          EQU  H'0004'
FIFOUA5          EQU  H'0005'
FIFOUA6          EQU  H'0006'
FIFOUA7          EQU  H'0007'


