GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F56Q83.inc
;----- IPR15 Bits -----------------------------------------------------
NVMIP            EQU  H'0000'
CLC8IP           EQU  H'0001'
CRCIP            EQU  H'0002'
TMR6IP           EQU  H'0003'
DMA8SCNTIP       EQU  H'0004'
DMA8DCNTIP       EQU  H'0005'
DMA8ORIP         EQU  H'0006'
DMA8AIP          EQU  H'0007'


;----- STATUS_CSHAD Bits -----------------------------------------------------
NOT_PD           EQU  H'0005'
NOT_TO           EQU  H'0006'
C                EQU  H'0000'
DC               EQU  H'0001'
Z                EQU  H'0002'
OV_STATUS_CSHAD  EQU  H'0003'
N                EQU  H'0004'
NPD              EQU  H'0005'
NTO              EQU  H'0006'
PD               EQU  H'0005'
TO               EQU  H'0006'


;----- WREG_CSHAD Bits -----------------------------------------------------


;----- SHADCON Bits -----------------------------------------------------
SHADLO           EQU  H'0000'


;----- STATUS_SHAD Bits -----------------------------------------------------
NOT_PD           EQU  H'0005'
NOT_TO           EQU  H'0006'
C                EQU  H'0000'
DC               EQU  H'0001'
Z                EQU  H'0002'
OV_STATUS_SHAD   EQU  H'0003'
N                EQU  H'0004'
NPD              EQU  H'0005'
NTO              EQU  H'0006'
PD               EQU  H'0005'
TO               EQU  H'0006'


;----- WREG_SHAD Bits -----------------------------------------------------


;----- PCLATH_SHAD Bits -----------------------------------------------------


;----- PCLATU_SHAD Bits -----------------------------------------------------
PCU0             EQU  H'0000'
PCU1             EQU  H'0001'
PCU2             EQU  H'0002'
PCU3             EQU  H'0003'
PCU4             EQU  H'0004'


;----- FSR0SH Bits -----------------------------------------------------
FSR0SH0          EQU  H'0000'
FSR0SH1          EQU  H'0001'
FSR0SH2          EQU  H'0002'
FSR0SH3          EQU  H'0003'
FSR0SH4          EQU  H'0004'
FSR0SH5          EQU  H'0005'
FSR0SH6          EQU  H'0006'
FSR0SH7          EQU  H'0007'
FSR0SH8          EQU  H'0008'
FSR0SH9          EQU  H'0009'
FSR0SH10         EQU  H'0010'
FSR0SH11         EQU  H'0011'
FSR0SH12         EQU  H'0012'
FSR0SH13         EQU  H'0013'


;----- FSR0H_SHAD Bits -----------------------------------------------------
FSR0H0           EQU  H'0000'
FSR0H1           EQU  H'0001'
FSR0H2           EQU  H'0002'
FSR0H3           EQU  H'0003'
FSR0H4           EQU  H'0004'
FSR0H5           EQU  H'0005'


;----- FSR1SH Bits -----------------------------------------------------
FSR1SH0          EQU  H'0000'
FSR1SH1          EQU  H'0001'
FSR1SH2          EQU  H'0002'
FSR1SH3          EQU  H'0003'
FSR1SH4          EQU  H'0004'
FSR1SH5          EQU  H'0005'
FSR1SH6          EQU  H'0006'
FSR1SH7          EQU  H'0007'
FSR1SH8          EQU  H'0008'
FSR1SH9          EQU  H'0009'
FSR1SH10         EQU  H'0010'
FSR1SH11         EQU  H'0011'
FSR1SH12         EQU  H'0012'
FSR1SH13         EQU  H'0013'


;----- FSR1H_SHAD Bits -----------------------------------------------------
FSR1H0           EQU  H'0000'
FSR1H1           EQU  H'0001'
FSR1H2           EQU  H'0002'
FSR1H3           EQU  H'0003'
FSR1H4           EQU  H'0004'
FSR1H5           EQU  H'0005'


;----- FSR2SH Bits -----------------------------------------------------
FSR2SH0          EQU  H'0000'
FSR2SH1          EQU  H'0001'
FSR2SH2          EQU  H'0002'
FSR2SH3          EQU  H'0003'
FSR2SH4          EQU  H'0004'
FSR2SH5          EQU  H'0005'
FSR2SH6          EQU  H'0006'
FSR2SH7          EQU  H'0007'
FSR2SH8          EQU  H'0008'
FSR2SH9          EQU  H'0009'
FSR2SH10         EQU  H'0010'
FSR2SH11         EQU  H'0011'
FSR2SH12         EQU  H'0012'
FSR2SH13         EQU  H'0013'


;----- FSR2H_SHAD Bits -----------------------------------------------------
FSR2H0           EQU  H'0000'
FSR2H1           EQU  H'0001'
FSR2H2           EQU  H'0002'
FSR2H3           EQU  H'0003'
FSR2H4           EQU  H'0004'
FSR2H5           EQU  H'0005'


;----- PRODSH Bits -----------------------------------------------------
PROD0            EQU  H'0000'
PROD1            EQU  H'0001'
PROD2            EQU  H'0002'
PROD3            EQU  H'0003'
PROD4            EQU  H'0004'
PROD5            EQU  H'0005'
PROD6            EQU  H'0006'
PROD7            EQU  H'0007'
PROD8            EQU  H'0008'
PROD9            EQU  H'0009'
PROD10           EQU  H'0010'
PROD11           EQU  H'0011'
PROD12           EQU  H'0012'
PROD13           EQU  H'0013'
PROD14           EQU  H'0014'
PROD15           EQU  H'0015'


;----- PRODH_SHAD Bits -----------------------------------------------------


;----- TU16ACON0 Bits -----------------------------------------------------
CIE              EQU  H'0000'
ZIE              EQU  H'0001'
PRIE             EQU  H'0002'
RDSEL            EQU  H'0003'
OPOL             EQU  H'0004'
OM               EQU  H'0005'
CPOL             EQU  H'0006'
ON_TU16ACON0     EQU  H'0007'
TU16ACIE         EQU  H'0000'
TU16AZIE         EQU  H'0001'
TU16APRIE        EQU  H'0002'
TU16ARDSEL       EQU  H'0003'
TU16AOPOL        EQU  H'0004'
TU16AOM          EQU  H'0005'
TU16ACPOL        EQU  H'0006'
TU16AON          EQU  H'0007'


;----- TU16ACON1 Bits -----------------------------------------------------
CIF              EQU  H'0000'
ZIF              EQU  H'0001'
PRIF             EQU  H'0002'
CAPT             EQU  H'0003'
LIMIT            EQU  H'0004'
CLR              EQU  H'0005'
OSEN             EQU  H'0006'
RUN              EQU  H'0007'
TU16ACIF         EQU  H'0000'
TU16AZIF         EQU  H'0001'
TU16APRIF        EQU  H'0002'
TU16ACAPT        EQU  H'0003'
TU16ALIMIT       EQU  H'0004'
TU16ACLR         EQU  H'0005'
TMRAOSEN         EQU  H'0006'
TU16ARUN         EQU  H'0007'


;----- TU16AHLT Bits -----------------------------------------------------
STOP0            EQU  H'0000'
STOP1            EQU  H'0001'
RESET0           EQU  H'0002'
RESET1           EQU  H'0003'
START0           EQU  H'0004'
START1           EQU  H'0005'
CSYNC            EQU  H'0006'
EPOL             EQU  H'0007'
STOP0            EQU  H'0000'
STOP1            EQU  H'0001'
RESET0           EQU  H'0002'
RESET1           EQU  H'0003'
START0           EQU  H'0004'
START1           EQU  H'0005'
TU16ASTOP0       EQU  H'0000'
TU16ASTOP1       EQU  H'0001'
TU16ARESET0      EQU  H'0002'
TU16ARESET1      EQU  H'0003'
TU16ASTART0      EQU  H'0004'
TU16ASTART1      EQU  H'0005'
TU16ACSYNC       EQU  H'0006'
TU16AEPOL        EQU  H'0007'
TU16ASTOP0       EQU  H'0000'
TU16ASTOP1       EQU  H'0001'
TU16ARESET0      EQU  H'0002'
TU16ARESET1      EQU  H'0003'
TU16ASTART0      EQU  H'0004'
TU16ASTART1      EQU  H'0005'


